In [18]:
# สร้าง Dataframe จาก List หลายตัวด้วย Zip
import pandas as pd
product1 = ["Keyborad","IT",4000]
product2 = ["Doll","Toy",500]
product3 = ["Mouse","IT",300]
datas = list(zip(product1,product2,product3))

In [19]:
cols = ["Product Name","Type","Price"]
df = pd.DataFrame(datas,columns=cols)

In [20]:
df

  Product Name  Type  Price
0     Keyborad  Doll  Mouse
1           IT   Toy     IT
2         4000   500    300

In [21]:
name = ["Keyborad","Mouse","Doll"]
category = ["IT","Toy","IT"]
price = [5000,400,300]
datas2 = list(zip(name,category,price))

In [22]:
cols = ["Product Name","Type","Price"]
df = pd.DataFrame(datas2,columns=cols)

In [23]:
df

  Product Name Type  Price
0     Keyborad   IT   5000
1        Mouse  Toy    400
2         Doll   IT    300